app/controllers/hashtags_controller.rb

  def show
    @statuses = Status.where("body LIKE ?", "%#{params[:id]}%")
---
SELECT "statuses".* FROM "statuses" WHERE (body LIKE '%ruby%')