app/controllers/statuses_controller.rb

INSERT INTO "statuses" ("body", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "first tweet"], ["creator_id", 2], ["created_at", "2016-07-10 05:46:06.130379"], ["updated_at", "2016-07-10 05:46:06.130379"]]
---
  def create
    @status = Status.new(status_params)
    @status.creator_id = session[:user_id]

    if @status.save