app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "mo"], ["password_digest", "$2a$10$spIf4orOzZZ6FlD4e1HqiO8eBoQjjzko47ewVtuyWB0J3EohD8X1W"], ["created_at", "2016-07-10 05:45:39.477600"], ["updated_at", "2016-07-10 05:45:39.477600"]]
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "mo"]]
---
  def show
    @user = User.find_by(username: params[:username])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def follow
    user = User.find(params[:id])

SELECT  "mentions".* FROM "mentions" WHERE "mentions"."mention_id" = ? AND "mentions"."viewed_at" IS NULL AND "mentions"."id" = ? LIMIT 1  [["mention_id", 1], ["id", nil]]
UPDATE "mentions" SET "viewed_at" = '2016-07-12 14:07:34.405344' WHERE "mentions"."mention_id" = ? AND "mentions"."viewed_at" IS NULL  [["mention_id", 1]]
---
  def mentions
    @mentions = current_user.mentions
    current_user.mentions.where(viewed_at: nil).update_all(viewed_at: Time.now)